import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

const DISHES_BY_MEAL_TIME: Record<string, string[]> = {
  "Завтрак": [
    "Овсяная каша", "Рисовая каша", "Бутерброд с плавленым сыром", "Гречневая каша", 
    "Бутерброд со сливочным маслом", "Пшённая каша", "Ячнёвая каша", "Отварное яйцо", 
    "Блинчики", "Бутерброд со сгущёнкой", "Молочный суп макаронами"
  ],
  "Витаминный перекус": [
    "яблоки", "бананы", "красная морковь", "хурма", "болгарский перец"
  ],
  "Обед": [
    "Суп перловый", "Суп чечевичный", "Суп маства с зеленью т/о", "Суп с макаронами", 
    "Борщ с зеленью т/о", "Суп фасолевый", "Суп свекольный", "Куринный суп с фрикадельками т/о", 
    "Суп машхурда с зеленью т/о", "Картофельный суп с фрикадельками т/о", "Бабушкин суп с зеленью т/о", 
    "Суп рассольник", "Суп гороховый т/о", "Куринный суп с вермишелью",
    "Мясная котлета с гречкой", "Отварные макароны с мясной подливой", "Куринная подлива с гречкой", 
    "Ханум с мясом и картошкой", "Плов", "Куриная котлета с картофельным пюре", "Гороховый пюре с мясной подливой", 
    "Манты с мясом и картошкой", "Мясные тефтели с картофельным пюре", "Куриная котлета с отварным рисом", 
    "Куриная подлива с картофельным пюре", "Мясные биточки с гречкой",
    "Салат из редьки", "Овощной салат", "Весенний салат", "Салат марковча", "Салат из свеклы", 
    "Салат из помидоров", "Салат из огурцов", "Салат капустно-морковный", "Осенний салат", "Салат винегрет", "Салат ачиччук",
    "Компот из сухофруктов", "Чай", "Напиток из шиповника", "Кисель", "Какао с молоком"
  ],
  "Полдник": [
    "Самса", "Сладкая булочка", "Творожная запеканка", "Омлет", "Маковый рулет", "Банановый пирог", 
    "Творожный пирог", "Пицца", "Рулет с корицей", "Хлеб с маслом", "Блинчики с картошкой", 
    "Куриный пирог", "Растигай с картошкой", "Пирог", "Рулет с маком", "Сама с мясом и картошкой", "Пирог Зебра", "Яблочный пирог", "Растигай"
  ]
};

async function main() {
  for (const [category, dishes] of Object.entries(DISHES_BY_MEAL_TIME)) {
    for (const dishName of dishes) {
      await prisma.dish.upsert({
        where: { name: dishName },
        update: { category },
        create: { name: dishName, category },
      });
    }
  }
  console.log('Seeding complete.');
}

main().catch(e => {
  console.error(e);
  process.exit(1);
}).finally(async () => {
  await prisma.$disconnect();
});
